Revit 2026 API

# RebarConstraint Properties

---

The RebarConstraint type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfTargets | Identifies the number of references associated to the rebar handle. |

#### Reference

RebarConstraint Class

Autodesk.Revit.DB.Structure Namespace